//             node Lesson_1/snippets         - запуск через термінал

//!------------------------------------------------------------------------------------------------
//? Перетворити на NUMBER
// let a = "15";
// //console.log(typeof a); // string
// a = +a;
// ///console.log("Result:", a); // 15
// //console.log("typeof:", typeof a); // number

//!------------------------------------------------------------------------------------------------
//? Останній елемент в МАСИВІ
// const array = [0, 1, 2, 3];
// array.slice(-1);
// // console.log("Result:", array.slice(-1)); // [3]

//!------------------------------------------------------------------------------------------------
//? Перетворення FLOAT на INT
// const int = 19.8 | 0;
// //console.log("Result:", int); // 19
// //console.log("typeof:", typeof int); // number

//!------------------------------------------------------------------------------------------------
//? Видалити останню цифру
// const int = (1553 / 10) | 0;
// //console.log("Result:", int); // 155
// //console.log("typeof:", typeof int); // number

//!------------------------------------------------------------------------------------------------
//? Обрізати МАСИВ
// const array = [0, 1, 2, 3, 4, 5];
// array.length = 3;
// console.log("Result:", array); // [0, 1, 2]
// console.log("typeof:", typeof array); // object

//!------------------------------------------------------------------------------------------------
//? Відфільтрувати УНІКАЛЬНІ
// const array = [1, 1, 2, 3, 6, 6, 3, 1];
// const uniqueArray = [...new Set(array)];

// // const uniqueArray2 = new Set(array);
// // console.log("Result:", uniqueArray2); // Set(4) { 1, 2, 3, 6 }
// // console.log("Result:", array); // [ 1, 1, 2, 3, 6, 6, 3, 1 ]
// // console.log("Result:", uniqueArray); // [ 1, 2, 3, 6 ]

//!------------------------------------------------------------------------------------------------

//!------------------------------------------------------------------------------------------------

//!------------------------------------------------------------------------------------------------

//!------------------------------------------------------------------------------------------------
