// node Lesson_3/script - запуск через термінал ≡

//! =============================================
//? Об'єкти
//! =============================================

// описують і групують х-ки об'єктів реального світу - користувача, книги, продукту магазину, чого завгодно.
//  Об'єкти ще називають словниками, тобто вони містять терміни (властивості) та їх визначення (значення).

// const book = {
//   title: "The Last Kingdom",
//   author: "Bernard Cornwell",
//   genres: ["historical prose", "adventure"],
//   public: true,
//   rating: 8.38,
// };
//? Для оголошення використовуються фігурні дужки {} - літерал об'єкта.
//? При створенні об'єкта можна додати властивості, кожна з яких описується парами 'ключ:значення'.
// Ключ ще називають ім'ям властивості і це завжди рядок.Значенням властивості можуть бути будь - які типи: примітиви, масиви, об'єкти, булі, функції тощо.Властивості розділяються комою.

//! =============================================
//* Task 1        Оголошення  Об'єкту
//! =============================================

//* Присвой змінній apartment об'єкт, який описує квартиру з наступними характеристиками:
//*      imgUrl - фотографія, значення "https://via.placeholder.com/640x480";
//*      descr - опис, значення "Spacious apartment in the city center";
//*      rating - рейтинг, значення 4;
//*      price - ціна, значення 2153;
//*      tags - метаінформація, масив ["premium", "promoted", "top"].

// const apartment = {
//   imgUrl: "https://via.placeholder.com/640x480",
//   descr: "Spacious apartment in the city center",
//   rating: 4,
//   price: 2153,
//   tags: ["premium", "promoted", "top"],
// };

// console.log(apartment);

//! =============================================
//*              Значенням властивості може бути інший об'єкт. Це використовується для зберігання вкладених і згрупованих даних.
//*            Наприклад, в статистиці користувача соц. мережі - к-сть послідовників, переглядів і лайків - зберігаються у вигляді об'єкта
//*            Те саме з місцем розташування, окремо країна і місто.
//*            В майбутньому це можна буде використовувати для пошуку користувачів за країною, містом, min або max к-стю послідовників.
//?                const user = {
//*                  name: "Jacques Gluke",
//*                  tag: "jgluke",
//? Task 2           location: {
//*                    country: "Jamaica",
//*                    city: "Ocho Rios",
//*                  },
//?                  stats: {
//*                    followers: 5603,
//*                    views: 4827,
//*                    likes: 1308,
//*                  },
//*                };
//! =============================================

//* Доповни об'єкт квартири властивістю owner, значенням якого буде об'єкт з інформацією про власника. Додай йому наступні властивості:
//*      name - ім'я власника, значення "Henry";
//*      phone - телефон, значення "982-126-1588";
//*      email - пошта, значення "henry.carter@aptmail.com".
//*      Оголошена змінна apartment
//*      Значення змінної apartment - це об'єкт
//*      В об'єкта змінної apartment присутні властивості imgUrl, descr, rating, price і tags зі значеннями
//*      В об'єкті apartment присутня властивість owner

// const apartment = {
//   imgUrl: "https://via.placeholder.com/640x480",
//   descr: "Spacious apartment in the city center",
//   rating: 4,
//   price: 2153,
//   tags: ["premium", "promoted", "top"],
//   owner: {
//     name: "Henry",
//     phone: "982-126-1588",
//     email: "henry.carter@aptmail.com",
//   },
// };

// console.log(apartment);

//! =============================================
//* Task 3
//! =============================================

//! =============================================
//* Task 4
//! =============================================

//! =============================================
//* Task 5
//! =============================================

//! =============================================
//* Task 6
//! =============================================

//! =============================================
//* Task 7
//! =============================================

//! =============================================
//* Task 8
//! =============================================

//! =============================================
//* Task 9
//! =============================================

//! =============================================
//* Task 10
//! =============================================

//! =============================================
//* Task 11
//! =============================================

//! =============================================
//* Task 12
//! =============================================

//! =============================================
//* Task 13
//! =============================================

//! =============================================
//* Task 14
//! =============================================

//! =============================================
//* Task 15
//! =============================================

//! =============================================
//* Task 16
//! =============================================

//! =============================================
//* Task 17
//! =============================================

//! =============================================
//* Task 18
//! =============================================

//! =============================================
//* Task 19
//! =============================================

//! =============================================
//* Task 20
//! =============================================

//! =============================================
//* Task 21
//! =============================================

//! =============================================
//* Task 22
//! =============================================

//! =============================================
//* Task 23
//! =============================================

//! =============================================
//* Task 24
//! =============================================

//! =============================================
//* Task 25
//! =============================================

//! =============================================
//* Task 26
//! =============================================

//! =============================================
//* Task 27
//! =============================================

//! =============================================
//* Task 28
//! =============================================

//! =============================================
//* Task 29
//! =============================================

//! =============================================
//* Task 30
//! =============================================

//! =============================================
//* Task 31
//! =============================================

//! =============================================
//* Task 32
//! =============================================

//! =============================================
//* Task 33
//! =============================================

//! =============================================
//* Task 34
//! =============================================

//! =============================================
//* Task 35
//! =============================================

//! =============================================
//* Task 36
//! =============================================
